ART-Badge/SDK/bsp_for_art-badge/libraries/src/app/wristband/src/rtl876x_i2c_wristband.c
    }
    else if (I2Cx == I2C1)
    {

    }
}

/**
  * @brief  Fills each I2C_InitStruct member with its default value.
  * @param  I2C_InitStruct : pointer to a I2C_InitTypeDef structure which will be initialized.
  * @retval None
  */
void I2C_StructInit(I2C_InitTypeDef *I2C_InitStruct)
{
    I2C_InitStruct->I2C_Clock             = 40000000;               /* depend on clock divider */
    I2C_InitStruct->I2C_ClockSpeed        = 400000;
    I2C_InitStruct->I2C_DeviveMode        = I2C_DeviveMode_Master;  /* Master mode */
    I2C_InitStruct->I2C_AddressMode       = I2C_AddressMode_7BIT;   /* 7-bit address mode */
    I2C_InitStruct->I2C_SlaveAddress      = 0;
    I2C_InitStruct->I2C_Ack               = I2C_Ack_Enable;
    I2C_InitStruct->I2C_TxThresholdLevel  = 0x00;                 /* tx fifo depth: 24 * 8bits */
    I2C_InitStruct->I2C_RxThresholdLevel  = 0x00;                 /* rx fifo depth: 16 * 8bits */
    I2C_InitStruct->I2C_TxDmaEn           = DISABLE;
    I2C_InitStruct->I2C_RxDmaEn           = DISABLE;
    I2C_InitStruct->I2C_RxWaterlevel      = 1;                    /* Best to equal GDMA Source MSize */
    I2C_InitStruct->I2C_TxWaterlevel      = 15;                   /* Best to equal Tx fifo minus
                                                                      GDMA Source MSize */
}


/**
  * @brief  Enables or disables the specified I2C peripheral.
  * @param  I2Cx: where x can be 0 or 1 to select the I2C peripheral.
  * @param  NewState: new state of the I2Cx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void I2C_Cmd(I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the selected I2C peripheral */
        I2Cx->IC_ENABLE |= 0x0001;
    }
    else
    {
        /* Disable the selected I2C peripheral */
        I2Cx->IC_ENABLE &= ~0x0001;
    }
}


/**
  * @brief  Checks whether the last I2Cx abort status.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @retval I2C_Status: the status of I2Cx.
  */
I2C_Status I2C_CheckAbortStatus(I2C_TypeDef *I2Cx)
{
    uint32_t abort_status = 0;

    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    rt_hw_us_delay(50); //400k 2.5us * 10 *2, we must do delay here by howie
    /* Get abort status */
    abort_status = I2Cx->IC_TX_ABRT_SOURCE;

    if (abort_status & MS_ALL_ABORT)
    {
        /* Clear abort status */
        I2Cx->IC_CLR_TX_ABRT;

        /* Check abort type */
        if (abort_status & ABRT_TXDATA_NOACK)
        {
            return I2C_ABRT_TXDATA_NOACK;
        }

        if (abort_status & ABRT_7B_ADDR_NOACK)
        {
            return I2C_ABRT_7B_ADDR_NOACK;
        }

        if (abort_status & ARB_LOST)
        {
            return I2C_ARB_LOST;
        }

        if (abort_status & ABRT_MASTER_DIS)
        {
            return I2C_ABRT_MASTER_DIS;
        }

        if (abort_status & ABRT_10ADDR1_NOACK)
        {
            return I2C_ABRT_10ADDR1_NOACK;
        }

        if (abort_status & ABRT_10ADDR2_NOACK)
        {
            return I2C_ABRT_10ADDR2_NOACK;
        }
    }

    return I2C_Success;
}

#if IIC_LEGACY
/**
  * @brief  Send data in master mode through the I2Cx peripheral.
  * @param  I2Cx: where x can be 0 or 1 to select the I2C peripheral.
  * @param  Data: Byte to be transmitted..
  * @retval None
  */
I2C_Status I2C_MasterWrite(I2C_TypeDef *I2Cx, uint8_t *pBuf, uint16_t len)
{
    uint16_t cnt = 0;
    I2C_Status abort_status = I2C_Success;

    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    /* Write in the DR register the data to be sent */
    for (cnt = 0; cnt < len; cnt++)
    {
        if (cnt >= len - 1)
        {
            /*generate stop signal*/
            I2Cx->IC_DATA_CMD = (*pBuf++) | (1 << 9);
        }
        else
        {
            I2Cx->IC_DATA_CMD = *pBuf++;
        }

        /* wait for flag of I2C_FLAG_TFNF */

        /* TX FIFO 24 * 8bit */
        /*if scl == 200k, FIFO NOT full means shift one byte out*/
        /*200K means 5us/bit, one byte 50us*/
        /*so, wait 50us is ok*/

        uint32_t local_time = timeout_us;
        while ((I2Cx->IC_STATUS & (1 << 1)) == 0)
        {
            /* Check abort status */
            abort_status = I2C_CheckAbortStatus(I2Cx);
            if (abort_status != I2C_Success)
            {
                return abort_status;
            }
            rt_hw_us_delay(10);
            local_time =  local_time - 10;

            if (local_time == 0)
            {
                APP_PRINT_ERROR0("[IIC] WRITE TIME OUT");//todo
                I2C_BusClear(I2Cx);
                return I2C_ERR_TIMEOUT;
            }
        }

        /* Check abort status */
        abort_status = I2C_CheckAbortStatus(I2Cx);
        if (abort_status != I2C_Success)
        {
            return abort_status;
        }
    }

    return abort_status;
}
#else
/**
  * @brief  Send data in master mode through the I2Cx peripheral.
  * @param  I2Cx: where x can be 0 or 1 to select the I2C peripheral.
  * @param  Data: Byte to be transmitted..
  * @retval None
  */
I2C_Status I2C_MasterWrite(I2C_TypeDef *I2Cx, uint8_t *pBuf, uint16_t len)
{
    uint16_t cnt = 0;
    I2C_Status abort_status = I2C_Success;

    /* Write in the DR register the data to be sent */
    for (cnt = 0; cnt < len; cnt++)
    {
        if (cnt >= len - 1)
        {
            /*generate stop signal*/
            I2Cx->IC_DATA_CMD = (*pBuf++) | (1 << 9);
            rt_hw_us_delay(50);
            uint32_t iic_timeout = 0;
            while (I2C_GetTxFIFOLen(I2Cx) > 0)
            {
                rt_hw_us_delay(10);// todo add for time out
                iic_timeout = iic_timeout + 10;
                abort_status = I2C_CheckAbortStatus(I2Cx);
                if (abort_status != I2C_Success)
                {
                    APP_PRINT_ERROR1("[IIC] MASTER Write Error line = %d", __LINE__);
                    return abort_status;
                }
                if (iic_timeout > IIC_MAX_TIMEOUT_US)
                {
                    return I2C_ERR_TIMEOUT;
                }
            }
        }
        else
        {
            I2Cx->IC_DATA_CMD = *pBuf++;
            rt_hw_us_delay(50);
            uint32_t iic_timeout = 0;
            while (I2C_GetTxFIFOLen(I2Cx) > 0)
            {
                rt_hw_us_delay(10);// todo add for time out
                iic_timeout = iic_timeout + 10;
                abort_status = I2C_CheckAbortStatus(I2Cx);
                if (abort_status != I2C_Success)
                {
                    APP_PRINT_ERROR1("[IIC] MASTER Write Error line = %d", __LINE__);
                    return abort_status;
                }
                if (iic_timeout > IIC_MAX_TIMEOUT_US)
                {
                    return I2C_ERR_TIMEOUT;
                }
            }
        }
    }
    uint32_t iic_timeout = 0;
    while (I2C_GetFlagState(I2Cx, I2C_FLAG_MST_ACTIVITY) == SET)
    {
        rt_hw_us_delay(10);// todo add for time out
        iic_timeout = iic_timeout + 10;
        abort_status = I2C_CheckAbortStatus(I2Cx);
        if (abort_status != I2C_Success)
        {
            APP_PRINT_ERROR1("[IIC] MASTER Write Error line = %d", __LINE__);
            return abort_status;
        }
        if (iic_timeout > IIC_MAX_TIMEOUT_US)
        {
            return I2C_ERR_TIMEOUT;
        }
    }

    return abort_status;
}
#endif

