ART-Badge/SDK/bsp_for_art-badge/libraries/src/app/wristband/src/rtl876x_i2c_wristband.c
#if IIC_LEGACY
/**
  * @brief  Read data in master mode through the I2Cx peripheral.
  * @param  I2Cx: where x can be 0 or 1 to select the I2C peripheral.
  * @param  Data: Byte to be transmitted..
  * @retval None
  */
I2C_Status I2C_MasterRead(I2C_TypeDef *I2Cx, uint8_t *pBuf, uint16_t len)
{
    uint16_t cnt = 0;
    uint32_t reg_value = 0;
    I2C_Status abort_status = I2C_Success;

    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    /* read in the DR register the data to be sent */
    for (cnt = 0; cnt < len; cnt++)
    {
        if (cnt >= len - 1)
        {
            /* generate stop singal */
            I2Cx->IC_DATA_CMD = (reg_value) | (0x0003 << 8);
        }
        else
        {
            I2Cx->IC_DATA_CMD = (reg_value) | (0x0001 << 8);
        }

        /* read data */
        uint32_t local_time = timeout_us;
        if (cnt > 0)
        {
            /* wait for I2C_FLAG_RFNE flag */
            while ((I2Cx->IC_STATUS & (1 << 3)) == 0)
            {
                /* Check abort status */
                abort_status = I2C_CheckAbortStatus(I2Cx);
                if (abort_status != I2C_Success)
                {
                    return abort_status;
                }

                rt_hw_us_delay(10);
                local_time =  local_time - 10;
                if (local_time == 0)
                {
                    APP_PRINT_ERROR0("[IIC] READ TIME OUT NOT LAST ONE");//todo
                    I2C_BusClear(I2Cx);
                    return I2C_ERR_TIMEOUT;
                }
            }

            *pBuf++ = (uint8_t)I2Cx->IC_DATA_CMD;
        }
    }

    /* wait for I2C_FLAG_RFNE flag */
    uint32_t local_time = timeout_us;
    while ((I2Cx->IC_STATUS & (1 << 3)) == 0)
    {
        /* Check abort status */
        abort_status = I2C_CheckAbortStatus(I2Cx);
        if (abort_status != I2C_Success)
        {
            return abort_status;
        }

        rt_hw_us_delay(10);
        local_time =  local_time - 10;
        if (local_time == 0)
        {
            APP_PRINT_ERROR0("[IIC] READ TIME OUT IS LAST ONE");//todo
            I2C_BusClear(I2Cx);
            return I2C_ERR_TIMEOUT;
        }
    }

    *pBuf = (uint8_t)I2Cx->IC_DATA_CMD;

    return abort_status;
}
#else
I2C_Status I2C_MasterRead(I2C_TypeDef *I2Cx, uint8_t *pBuf, uint16_t len)
{
    uint16_t cnt = 0;
    uint32_t reg_value = 0;
    I2C_Status abort_status = I2C_Success;

    /* read in the DR register the data to be sent */
    for (cnt = 0; cnt < len; cnt++)
    {
        if (cnt >= len - 1)
        {
            /* generate stop singal */
            I2Cx->IC_DATA_CMD = (reg_value) | (0x0003 << 8);
            uint32_t iic_timeout = 0;
            while (I2C_GetTxFIFOLen(I2Cx) > 0)
            {
                rt_hw_us_delay(10);
                iic_timeout = iic_timeout + 10;
                abort_status = I2C_CheckAbortStatus(I2Cx);
                if (abort_status != I2C_Success)
                {
                    APP_PRINT_ERROR1("[IIC] MASTER Read Error line = %d", __LINE__);
                    return abort_status;
                }
                if (iic_timeout > IIC_MAX_TIMEOUT_US)
                {
                    return I2C_ERR_TIMEOUT;
                }
            }
        }
        else
        {
            I2Cx->IC_DATA_CMD = (reg_value) | (0x0001 << 8);
            uint32_t iic_timeout = 0;
            while (I2C_GetTxFIFOLen(I2Cx) > 0)
            {
                rt_hw_us_delay(10);
                iic_timeout = iic_timeout + 10;
                abort_status = I2C_CheckAbortStatus(I2Cx);
                if (abort_status != I2C_Success)
                {
                    APP_PRINT_ERROR1("[IIC] MASTER Read Error line = %d", __LINE__);
                    return abort_status;
                }
                if (iic_timeout > IIC_MAX_TIMEOUT_US)
                {
                    return I2C_ERR_TIMEOUT;
                }
            }
        }

        uint32_t iic_timeout = 0;
        while (I2C_GetRxFIFOLen(I2Cx) == 0)
        {
            rt_hw_us_delay(10);
            iic_timeout = iic_timeout + 10;
            abort_status = I2C_CheckAbortStatus(I2Cx);
            if (abort_status != I2C_Success)
            {
                APP_PRINT_ERROR1("[IIC] MASTER Read Error line = %d", __LINE__);
                return abort_status;
            }
            if (iic_timeout > IIC_MAX_TIMEOUT_US)
            {
                return I2C_ERR_TIMEOUT;
            }
        }
        *pBuf++ = (uint8_t)I2Cx->IC_DATA_CMD;

    }

    uint32_t iic_timeout = 0;
    while (I2C_GetFlagState(I2Cx, I2C_FLAG_MST_ACTIVITY) == SET)
    {
        rt_hw_us_delay(10);// todo add for time out
        iic_timeout = iic_timeout + 10;
        abort_status = I2C_CheckAbortStatus(I2Cx);
        if (abort_status != I2C_Success)
        {
            APP_PRINT_ERROR1("[IIC] MASTER Read Error line = %d", __LINE__);
            return abort_status;
        }
        if (iic_timeout > IIC_MAX_TIMEOUT_US)
        {
            return I2C_ERR_TIMEOUT;
        }
    }

    return abort_status;
}
#endif

#if IIC_LEGACY
/**
  * @brief  Sends data and read data in master mode through the I2Cx peripheral.Attention:Read data with time out mechanism.
  * @param  I2Cx: where x can be 0 or 1 to select the I2C peripheral.
  * @param  Data: Byte to be transmitted..
  * @retval Actual length of read data
  */
I2C_Status I2C_RepeatRead(I2C_TypeDef *I2Cx, uint8_t *pWriteBuf, uint16_t Writelen,
                          uint8_t *pReadBuf, uint16_t Readlen)
{
    uint16_t cnt = 0;
    uint32_t reg_value = 0;
    I2C_Status abort_status = I2C_Success;

    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    /*------------------------------ write data section ------------------------------*/
    /* write data in the IC_DATA_CMD register */
    for (cnt = 0; cnt < Writelen; cnt++)
    {
        I2Cx->IC_DATA_CMD = *pWriteBuf++;

        /*wait for I2C_FLAG_TFNF flag that Tx FIFO is not full*/
        uint32_t local_time = timeout_us;
        while ((I2Cx->IC_STATUS & BIT(1)) == 0)
        {
            /* Check abort status */
            abort_status = I2C_CheckAbortStatus(I2Cx);
            if (abort_status != I2C_Success)
            {
                return abort_status;
            }

            rt_hw_us_delay(10);
            local_time =  local_time - 10;
            if (local_time == 0)
            {
                APP_PRINT_ERROR0("[IIC] REPEART TIME OUT WRITE");//todo
                I2C_BusClear(I2Cx);
                return I2C_ERR_TIMEOUT;
            }
        }

        /* Check abort status */
        abort_status = I2C_CheckAbortStatus(I2Cx);
        if (abort_status != I2C_Success)
        {
            return abort_status;
        }
    }

    /*------------------------------ read data section ------------------------------*/
    for (cnt = 0; cnt < Readlen; cnt++)
    {
        if (cnt >= Readlen - 1)
        {
            /*generate stop singal in last byte which to be sent*/
            I2Cx->IC_DATA_CMD = reg_value | BIT(8) | BIT(9);
        }
        else
        {
            I2Cx->IC_DATA_CMD = reg_value | BIT(8);
        }

        /*read data */
        uint32_t local_time = timeout_us;
        if (cnt > 0)
        {
            /* wait for I2C_FLAG_RFNE flag */
            while ((I2Cx->IC_STATUS & (1 << 3)) == 0)
            {
                /* Check abort status */
                abort_status = I2C_CheckAbortStatus(I2Cx);
                if (abort_status != I2C_Success)
                {
                    return abort_status;
                }

                rt_hw_us_delay(10);
                local_time =  local_time - 10;
                if (local_time == 0)
                {
                    APP_PRINT_ERROR0("[IIC] REPEAT TIME OUT NOT LAST ONE");//todo
                    I2C_BusClear(I2Cx);
                    return I2C_ERR_TIMEOUT;
                }
            }

            *pReadBuf++ = (uint8_t)I2Cx->IC_DATA_CMD;
        }
    }

    /*read data*/
    uint32_t local_time = timeout_us;
    while ((I2Cx->IC_STATUS & (1 << 3)) == 0)
    {
        /* Check abort status */
        abort_status = I2C_CheckAbortStatus(I2Cx);
        if (abort_status != I2C_Success)
        {
            return abort_status;
        }

        rt_hw_us_delay(10);
        local_time =  local_time - 10;
        {
            APP_PRINT_ERROR0("[IIC] REPEAT TIME OUT IS LAST ONE");//todo
            I2C_BusClear(I2Cx);
            return I2C_ERR_TIMEOUT;
        }
    }

    *pReadBuf = (uint8_t)I2Cx->IC_DATA_CMD;

    return abort_status;
}
#else
I2C_Status I2C_RepeatRead(I2C_TypeDef *I2Cx, uint8_t *pWriteBuf, uint16_t Writelen,
                          uint8_t *pReadBuf, uint16_t Readlen)
{
    I2C_Status ret = I2C_Success;
    ret = I2C_MasterWrite(I2Cx, pWriteBuf, Writelen);
    if (ret != I2C_Success)
    {
        return ret;
    }
    rt_hw_us_delay(1);
    return I2C_MasterRead(I2Cx, pReadBuf, Readlen);
}
#endif

/**
  * @brief mask the specified I2C interrupt.
  * @param  I2Cx: where x can be 0 or 1
  * @param  I2C_INT
  * This parameter can be one of the following values:
  *     @arg I2C_INT_GEN_CALL: Set only when a General Call address is received and it is acknowledged.
  *     @arg I2C_INT_START_DET: Indicates whether a START or RESTART condition has occurred on the I2C
                              interface regardless of whether I2C is operating in slave or master mode.
  *     @arg I2C_INT_STOP_DET:  Indicates whether a STOP condition has occurred on the I2C interface regardless
                              of whether I2C is operating in slave or master mode
  *     @arg I2C_INT_ACTIVITY:  This bit captures I2C activity and stays set until it is cleared.
  *     @arg I2C_INT_RX_DONE:   When the I2C is acting as a slave-transmitter, this bit is set to 1 if the
                              master does not acknowledge a transmitted byte. This occurs on the last byte of
                              the transmission, indicating that the transmission is done.
  *     @arg I2C_INT_TX_ABRT:   This bit indicates if I2C as an I2C transmitter, is unable to complete the
                              intended actions on the contents of the transmit FIFO.
  *     @arg I2C_INT_RD_REQ:    This bit is set to 1 when acting as a slave and another I2C master
                              is attempting to read data.
  *     @arg I2C_INT_TX_EMPTY:  This bit is set to 1 when the transmit buffer is at or below the threshold value set
                              in the IC_TX_TL register.
  *     @arg I2C_INT_TX_OVER:   Set during transmit if the transmit buffer is filled to IC_TX_BUFFER_DEPTH and
                              the processor attempts to issue another I2C command.
  *     @arg I2C_INT_RX_FULL:   Set when the receive buffer reaches or goes above the RX_TL threshold in the
                              IC_RX_TL register
  *     @arg I2C_INT_RX_OVER:   Set if the receive buffer is completely filled to IC_RX_BUFFER_DEPTH and an
                               additional byte is received from an external I2C device.
  *     @arg I2C_INT_RX_UNDER:   Set if the processor attempts to read the receive buffer when it is empty by reading.
  * @retval None.
  */
void I2C_INTConfig(I2C_TypeDef *I2Cx, uint16_t I2C_INT, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(I2C_GET_INT(I2C_INT));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the selected I2C interrupts */
        I2Cx->IC_INTR_MASK |= I2C_INT;
    }
    else
    {
        /* Disable the selected I2C interrupts */
        I2Cx->IC_INTR_MASK &= (uint16_t)~I2C_INT;
    }
}

/**
  * @brief clear the specified I2C interrupt.
  * @param  I2Cx: where x can be 0 or 1
  * @retval None.
  */
void I2C_ClearINTPendingBit(I2C_TypeDef *I2Cx, uint16_t I2C_IT)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(I2C_GET_INT(I2C_IT));

    switch (I2C_IT)
    {
    case I2C_INT_RX_UNDER:
        {
            I2Cx->IC_CLR_RX_UNDER;
            break;
        }
    case I2C_INT_RX_OVER:
        {
            I2Cx->IC_CLR_RX_OVER;
            break;
        }
    case I2C_INT_TX_OVER:
        {
            I2Cx->IC_CLR_TX_OVER;
            break;
        }
    case I2C_INT_RD_REQ:
        {
            I2Cx->IC_CLR_RD_REQ;
            break;
        }
    case I2C_INT_TX_ABRT:
        {
            I2Cx->IC_CLR_TX_ABRT;
            break;
        }
    case I2C_INT_RX_DONE:
        {
            I2Cx->IC_CLR_RX_DONE;
            break;
        }
    case I2C_INT_ACTIVITY:
        {
            I2Cx->IC_CLR_ACTIVITY;
            break;
        }
    case I2C_INT_STOP_DET:
        {
            I2Cx->IC_CLR_STOP_DET;
            break;
        }
    case I2C_INT_START_DET:
        {
            I2Cx->IC_CLR_START_DET;
            break;
        }
    case I2C_INT_GEN_CALL:
        {
            I2Cx->IC_CLR_GEN_CALL;
            break;
        }
    default:
        {
            break;
        }
    }
}

/******************* (C) COPYRIGHT 2015 Realtek Semiconductor Corporation *****END OF FILE****/

